applications/test/chtMultiRegionFoam_with_NEARESTPATCHFACEACMI/cases/v2206/multiRegionHeater_autoPatch/0.orig/topAir/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0/topAir";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 300;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    maxY
    {
        type            zeroGradient;
    }
    minX
    {
        type            uniformFixedValue;
        uniformValue    300;
    }
    maxX
    {
        type            inletOutlet;
        value           uniform 300;
        inletValue      uniform 300;
    }
    minZ
    {
        type            zeroGradient;
    }
    maxZ
    {
        type            zeroGradient;
    }
    group_solid
    {
        type            compressible::turbulentTemperatureRadCoupledMixed2;
        value           uniform 300;
        Tnbr            T;
        kappaMethod     fluidThermo;
        nonOverlapPatch
        {
            type            uniformFixedValue;
            uniformValue    12345;
        }
    }
    group_fluid
    {
        type            compressible::turbulentTemperatureRadCoupledMixed2;
        value           uniform 300;
        Tnbr            T;
        kappaMethod     fluidThermo;
        nonOverlapPatch
        {
            type            uniformFixedValue;
            uniformValue    12345;
        }
    }
}


// ************************************************************************* //
